# PropertySetKeywords Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySetKeywords Property
ParameterTypeId Class See Also
---
"Keywords"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySetKeywords { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySetKeywords As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySetKeywords {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace